      /if not defined(COPYRIGHT_DSPEC)
     H COPYRIGHT('V1.9.5 - 03.03.2017 - mailto:thomas.raddatz@tools400.de')
      /eof
      /endif
     D IFS_VERSION...
     D                 C                   '1.9.5'
     D IFS_DATE...
     D                 C                   '03.03.2017'
