**free
/if not defined(COPYRIGHT_DSPEC)
ctl-opt copyright('V1.10.0 - 10.05.2026 - mailto: thomas.raddatz@tools400.de');
/eof
/endif
dcl-c IFS_VERSION '1.10.0';
dcl-c IFS_DATE '10.05.2026';
