      /if not defined(COPYRIGHT_DSPEC)
     H COPYRIGHT('V1.9.6 - 08.12.2025 - mailto:thomas.raddatz@tools400.de')
      /eof
      /endif
     D IFS_VERSION...
     D                 C                   '1.9.6'
     D IFS_DATE...
     D                 C                   '08.12.2025'
