      *---------------------------------------------------------------
      * Datenstruktur für Message-ID : IFS1030
      *
      * &1[1030] Das aktuelle Verzeichnis konnte nicht auf '&1' geä
      *
     D IFS1030         DS
     D  IFS10301                    128A   INZ(*BLANKS)
     D  IFS10302                    010P 0 INZ(*ZEROS )
     D  IFS10303                    128A   INZ(*BLANKS)
     D IFS1030#        S              8B 0 INZ(0262)
      *
