      *---------------------------------------------------------------
      * Datenstruktur für Message-ID : IFS1024
      *
      * &1[1024] Ungültige Pfadangabe.
      *
     D IFS1024         DS
     D  IFS10241                    001A   INZ(*BLANKS)
     D  IFS10242                    128A   INZ(*BLANKS)
     D IFS1024#        S              8B 0 INZ(0129)
      *
