      *---------------------------------------------------------------
      * Datenstruktur für Message-ID : IFS1014
      *
      * &1[1014] IFS-Dateiname enthält ungültige Zeichen oder Pfada
      *
     D IFS1014         DS
     D  IFS10141                    001A   INZ(*BLANKS)
     D  IFS10142                    128A   INZ(*BLANKS)
     D IFS1014#        S              8B 0 INZ(0129)
      *
