      *---------------------------------------------------------------
      * Datenstruktur für Message-ID : IFS1013
      *
      * &1[1013] IFS-Datei existiert.
      *
     D IFS1013         DS
     D  IFS10131                    001A   INZ(*BLANKS)
     D  IFS10132                    128A   INZ(*BLANKS)
     D IFS1013#        S              8B 0 INZ(0129)
      *
