      *---------------------------------------------------------------
      * Datenstruktur für Message-ID : IFS1011
      *
      * &1[1011] IFS-Verzeichnis nicht vorhanden.
      *
     D IFS1011         DS
     D  IFS10111                    001A   INZ(*BLANKS)
     D  IFS10112                    128A   INZ(*BLANKS)
     D IFS1011#        S              8B 0 INZ(0129)
      *
