      *---------------------------------------------------------------
      * Datenstruktur für Message-ID : IFS1015
      *
      * &1[1015] IFS-Verzeichnis existiert.
      *
     D IFS1015         DS
     D  IFS10151                    001A   INZ(*BLANKS)
     D  IFS10152                    128A   INZ(*BLANKS)
     D IFS1015#        S              8B 0 INZ(0129)
      *
