      *---------------------------------------------------------------
      * Datenstruktur für Message-ID : IFS1012
      *
      * &1[1012] IFS-Datei nicht vorhanden.
      *
     D IFS1012         DS
     D  IFS10121                    001A   INZ(*BLANKS)
     D  IFS10122                    128A   INZ(*BLANKS)
     D IFS1012#        S              8B 0 INZ(0129)
      *
