      *---------------------------------------------------------------
      * Datenstruktur für Message-ID : IFS1029
      *
      * &1[1029] Das aktuelle Verzeichnis konnte nicht ermittelt we
      *
     D IFS1029         DS
     D  IFS10291                    010P 0 INZ(*ZEROS )
     D  IFS10292                    128A   INZ(*BLANKS)
     D IFS1029#        S              8B 0 INZ(0134)
      *
