      *---------------------------------------------------------------
      * Datenstruktur für Message-ID : IFS1016
      *
      * &1[1016] Pufferüberlauf beim Lesen aus der IFS Datei '&2'
      *
     D IFS1016         DS
     D  IFS10161                    001A   INZ(*BLANKS)
     D  IFS10162                    128A   INZ(*BLANKS)
     D  IFS10163                    010P 0 INZ(*ZEROS )
     D IFS1016#        S              8B 0 INZ(0135)
      *
