      *---------------------------------------------------------------
      * Datenstruktur für Message-ID : IFS1023
      *
      * &1[1023] Fehler beim Erstellen eines temporären Pfadnamens
      *
     D IFS1023         DS
     D  IFS10231                    001A   INZ(*BLANKS)
     D  IFS10232                    010P 0 INZ(*ZEROS )
     D  IFS10233                    128A   INZ(*BLANKS)
     D IFS1023#        S              8B 0 INZ(0135)
      *
